{
  "</tool_call>": 151658,
  "<TGT:ALE>": 151665,
  "<TGT:ALG>": 151666,
  "<TGT:ALX>": 151667,
  "<TGT:AMM>": 151668,
  "<TGT:ASW>": 151669,
  "<TGT:BAG>": 151670,
  "<TGT:BAS>": 151671,
  "<TGT:BEI>": 151672,
  "<TGT:BEN>": 151673,
  "<TGT:CAI>": 151674,
  "<TGT:DAM>": 151675,
  "<TGT:DOH>": 151676,
  "<TGT:FES>": 151677,
  "<TGT:JED>": 151678,
  "<TGT:JER>": 151679,
  "<TGT:KHA>": 151680,
  "<TGT:MOS>": 151681,
  "<TGT:MSA>": 151682,
  "<TGT:MUS>": 151683,
  "<TGT:RAB>": 151684,
  "<TGT:RIY>": 151685,
  "<TGT:SAL>": 151686,
  "<TGT:SAN>": 151687,
  "<TGT:SFX>": 151688,
  "<TGT:TRI>": 151689,
  "<TGT:TUN>": 151690,
  "<tool_call>": 151657,
  "<|box_end|>": 151649,
  "<|box_start|>": 151648,
  "<|endoftext|>": 151643,
  "<|file_sep|>": 151664,
  "<|fim_middle|>": 151660,
  "<|fim_pad|>": 151662,
  "<|fim_prefix|>": 151659,
  "<|fim_suffix|>": 151661,
  "<|im_end|>": 151645,
  "<|im_start|>": 151644,
  "<|image_pad|>": 151655,
  "<|object_ref_end|>": 151647,
  "<|object_ref_start|>": 151646,
  "<|quad_end|>": 151651,
  "<|quad_start|>": 151650,
  "<|repo_name|>": 151663,
  "<|video_pad|>": 151656,
  "<|vision_end|>": 151653,
  "<|vision_pad|>": 151654,
  "<|vision_start|>": 151652
}
