{
  "</tool_call>": 151658,
  "<SRC:ALE>": 151665,
  "<SRC:ALG>": 151666,
  "<SRC:ALX>": 151667,
  "<SRC:AMM>": 151668,
  "<SRC:ASW>": 151669,
  "<SRC:BAG>": 151670,
  "<SRC:BAS>": 151671,
  "<SRC:BEI>": 151672,
  "<SRC:BEN>": 151673,
  "<SRC:CAI>": 151674,
  "<SRC:DAM>": 151675,
  "<SRC:DOH>": 151676,
  "<SRC:FES>": 151677,
  "<SRC:JED>": 151678,
  "<SRC:JER>": 151679,
  "<SRC:KHA>": 151680,
  "<SRC:MOS>": 151681,
  "<SRC:MSA>": 151682,
  "<SRC:MUS>": 151683,
  "<SRC:RAB>": 151684,
  "<SRC:RIY>": 151685,
  "<SRC:SAL>": 151686,
  "<SRC:SAN>": 151687,
  "<SRC:SFX>": 151688,
  "<SRC:TRI>": 151689,
  "<SRC:TUN>": 151690,
  "<tool_call>": 151657,
  "<|box_end|>": 151649,
  "<|box_start|>": 151648,
  "<|endoftext|>": 151643,
  "<|file_sep|>": 151664,
  "<|fim_middle|>": 151660,
  "<|fim_pad|>": 151662,
  "<|fim_prefix|>": 151659,
  "<|fim_suffix|>": 151661,
  "<|im_end|>": 151645,
  "<|im_start|>": 151644,
  "<|image_pad|>": 151655,
  "<|object_ref_end|>": 151647,
  "<|object_ref_start|>": 151646,
  "<|quad_end|>": 151651,
  "<|quad_start|>": 151650,
  "<|repo_name|>": 151663,
  "<|video_pad|>": 151656,
  "<|vision_end|>": 151653,
  "<|vision_pad|>": 151654,
  "<|vision_start|>": 151652
}
